WW = input('Введите слово: ')
W = list(WW.strip())
#W = ['ш', 'к', 'а', 'ф']
S1 = ['а', 'В', 'в', 'Е', 'е', 'И', 'и', 'Н', 'н', 'О', 'о', 'Р', 'р', 'С', 'с', 'Т', 'т']
S2 = ['Д', 'д', 'К', 'к', 'л', 'Л', 'М', 'м', 'П', 'п', 'у', 'У']
S3 = ['Б', 'б', 'Г', 'г' 'Ё', 'ё', 'Ь', 'ь', 'я', 'Я']
S4 = ['Й', 'й', 'ы', 'Ы']
S5 = ['Ж', 'ж', 'З', 'з', 'Х', 'х', 'Ц', 'ц', 'ч', 'Ч']
S6 = ['Ш', 'ш', 'Э', 'э', 'ю', 'Ю']
S7 = ['Ф', 'ф', 'щ', 'Щ', 'Ъ', 'ъ']
A1 = ['A', 'a', 'E', 'e', 'I', 'i', 'o', 'O', 'u', 'U', 'l', 'L', 'n', 'N', 's', 'S', 't', 'T', 'r', 'R']
A2 = ['D', "d", 'G', "g"] 
A3 = ['B', 'b', 'C', 'c', 'm', 'M', 'p', 'P']
A4 = ['F', 'f', 'h', 'H', 'v', 'V', 'w', 'W', 'y', 'Y']
A5 = ['k', 'K']
A6 = ['j', 'J', 'x', 'X']
A7 = ['q', 'Q','z', 'Z']
count = 0
for i in W:
    if (i in S1 or i in A1):
        count +=1
    elif (i in S2 or i in A2):
        count +=2
    elif (i in S3 or i in A3):
        count +=3
    elif (i in S4 or i in A4):
        count +=4
    elif (i in S5 or i in A5):
        count +=5
    elif (i in S6 or i in A6):
        count +=8
    elif (i in S7 or i in A7):
        count +=10
print("Стоимость слова", WW, "равна", count)